# HasDeletedLinks Method (2022)

---
C#Visual BasicVisual C++
Revit 2022 API
---
AnalyticalModel..::..HasDeletedLinks Method
AnalyticalModel Class See Also
---
Indicates if Analytical Model contains deleted Analytical Links.
**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)**Since:** 2013
# Syntax
C#
---
```text
public bool HasDeletedLinks()
```

Visual Basic
---
```text
Public Function HasDeletedLinks As Boolean
```

Visual C++
---
```text
public:
bool HasDeletedLinks()
```

# ### Return Value
True if contains, false otherwise.
# See Also
AnalyticalModel Class
Autodesk.Revit.DB.Structure Namespace